# AnalyticalCurvedPanelNotValid Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..AnalyticalModelFailures..::..AnalyticalCurvedPanelNotValid Property
BuiltInFailures..::..AnalyticalModelFailures Class See Also
---
Analytical Curved Panel is not valid.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId AnalyticalCurvedPanelNotValid { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AnalyticalCurvedPanelNotValid As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ AnalyticalCurvedPanelNotValid {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..AnalyticalModelFailures Class
Autodesk.Revit.DB Namespace